//
//  ICUSaying.swift
//  ICU996
//
//  Created by HanLiu on 2019/3/29.
//  Copyright © 2019 Harry Duan. All rights reserved.
//

import UIKit

class ICUSaying: NSObject {
    static let morning = [
                "宁可辛苦一阵子，不要辛苦一辈子，你是最棒的！",
                "不管什么时候，遇到什么困难，请你一定要积极去面对。",
                "这一生，我们应该学会如何让自己跑的更快，而不是想方设法让别人如何慢下来。",
                "一个人追求的目标越高，他的才力就发展得越快，对社会就越有益。",
                "一个真正想成功的人是勤奋与努力的，而不是躺在床上说大话。",
                "能坚持别人不能坚持的才能拥有别人不能拥有的。",
                "成功者与失败者之间的区别，常在于成功者能由错误中获益，并以不同的方式再尝试。",
                "机会是自己创造的，而不能一味的等待别人的赐予。",
                "谋事在人；成事在天；事在人为：不去做你怎么知道行还是不行。",
                "这一秒不放弃，下一秒就有希望！坚持下去才可能成功！",
                "不要等待机会，而要创造机会。",
                "今天，你穿格子衫了么",
                "程序员面试因穿格子衫被认为新手，摘下帽子后当场录取！",
                "你有对象吗？没有？自己 new 一个呗！",
                "为了家庭还在拼搏的你，辛苦了啊",
                "别人拥有的，你不必羡慕，只要努力，你也会拥有。",
                "你要记住你不是为别人而活，你是为自己而活。",
                "请用今天的努力让明天没有遗憾。",
                ]
    
    static let night = [
                "这个世界最脆弱的是生命，身体健康，很重要！",
                "虽然你赚的钱多，但是也得保重身体才能花啊",
                "成功不是凭梦想和希望，而是凭努力和实践。",
                "有一种成功，叫永不言弃；有一种成功，叫继续努力。",
                "工作使你快乐",
                "自己选择的路、跪着也要把它走完。",
                "一份耕耘一份收获，未必；九份耕耘一份收获，一定。",
                "植发3W，你需要吗？",
                "亲加班这么晚，彦祖也变苏大强哦！",
                "给队友擦屁股到这么晚么，心疼你哟",
                "夜太黑，尽管再心累，总有人黑着眼眶敲着键",
                "为什么加班？眼里总有bug么？",
                "头发需要经常打理，不然这么晚下班会被误以为小偷的哟",
                "出自 Python 之父：The 996 work schedule is inhumain.",
                "为了家庭还在拼搏的你，辛苦了啊",
                "需求千万条，下班第一条，打卡不及时，薪资两行泪",
                "下班了，回家跟家里人说一声，爱你",
                "天黑了，回家的路上多加小心。",
                "你现在所做的，只是为以后不会后悔，只是为以后那比之更加灿烂的人生。",
                "贵在坚持难在坚持成在坚持。",
                "独自一人在外工作？可联系我们，我们一起往前走！",
                ]
    
    class func morningSaying() -> String {
        let index = Int.random(in: Range(NSMakeRange(0, morning.count))!)
        return morning[index]
    }
    
    class func nightSaying() -> String {
        let index = Int.random(in: Range(NSMakeRange(0, night.count))!)
        return night[index]
    }
    
    
    
    //正面的，积极的，鼓励的鸡汤
    enum Positive: String {
        case a = "为了家庭还在拼搏的你，辛苦了啊"
        case b = "虽然你赚的钱多，但是也得保重身体才能花啊"
        case c = "生活不止996，还有诗和远方"
        case d = "新的一天开始了，准备好迎接挑战了吗？"
        case e = "Family, Duty, Honor"
        case f = "Growing Strong"
    }
    //负面的，消极的，毒汤,调侃
    enum Negative: String {
        case a = "嘿，你知道吗？听说前天加班到3点的老王头顶大草原"
        case b = "虽然你加班时间长，但是你穷啊"
        case c = "为什么加班？眼里总有bug么？"
        case d = "今天有背锅改bug么"
        case e = "夜太黑，尽管再心累，总有人黑着眼眶敲着键"
        case f = "你觉得世界上最好的语言是什么?"
        case g = "你有对象吗？没有？自己 new 一个呗！"
        case h = "The 996 work schedule is inhumain"
        case i = "今年加薪了么？一猜就没有，因为你只会加班啊"
    }
}
